Revit 2024 API
BuiltInFailures.SiteFailures.NotEnoughPointsInSurface Property
 The surface must have at least three distinct Points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotEnoughPointsInSurface { get; }
Visual Basic
Public Shared ReadOnly Property NotEnoughPointsInSurface As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotEnoughPointsInSurface {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace